app/controllers/songs_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-10-12 22:02:34.060008"], ["updated_at", "2018-10-12 22:02:34.060008"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 137], ["created_at", "2018-10-12 22:02:34.090869"], ["updated_at", "2018-10-12 22:02:34.090869"]]
---
  def upload
     CSV.foreach(params[:leads].path, headers: true) do |lead|
      Songs.create(song: lead[0], artist_name: lead[1])